# TopFlangeWidth Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionIWelded..::..TopFlangeWidth Property
StructuralSectionIWelded Class See Also
---
Top Flange Width.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public double TopFlangeWidth { get; set; }
```

Visual Basic
---
```text
Public Property TopFlangeWidth As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double TopFlangeWidth {
	double get ();
	void set (double value);
}
```

# See Also
StructuralSectionIWelded Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace